---

C#Visual BasicVisual C++

Revit 2024 API
---
ParameterDownloadOptions..::..SetCategories Method
ParameterDownloadOptions Class See Also Send Feedback
---

Set categories for binding.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024

# Syntax

C#
---

    public void SetCategories(
    	ISet<ElementId> categories
    )

Visual Basic
---

    Public Sub SetCategories ( _
    	categories As ISet(Of ElementId) _
    )

Visual C++
---

    public:
    void SetCategories(
    	ISet<ElementId^>^ categories
    )

#### Parameters

categories
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)>

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also

ParameterDownloadOptions Class

Autodesk.Revit.DB Namespace